src/cf/InformationRegisters/ДанныеКлючаСессииМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДанныеКлючаСессииМДЛП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяПараметраКлючаСессии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ДанныеКлючаСессииМДЛП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура УстановитьКлючСессии(ПараметрыЗапроса, ПараметрыКлючаСессии) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить(Метаданные.РегистрыСведений.ДанныеКлючаСессииМДЛП.ПолноеИмя());
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("ИмяПараметраКлючаСессии", ПараметрыЗапроса.ИмяПараметраКлючаСессии);
		Блокировка.Заблокировать();
		
		ДанныеКлючаСессии = ПолучитьСохраненныеДанныеКлючаСессии(ПараметрыЗапроса.ИмяПараметраКлючаСессии);
		Если ДанныеКлючаСессии = Неопределено Тогда
			ДанныеКлючаСессии = Новый Соответствие;
		КонецЕсли;
		
		Если ПараметрыКлючаСессии.КлючСессии = "" Или ПараметрыКлючаСессии.ДействуетДо = Дата(1,1,1) Тогда
			ДанныеКлючаСессии.Удалить(ПараметрыЗапроса.Организация);
		Иначе
			ДанныеКлючаСессии.Вставить(ПараметрыЗапроса.Организация, ПараметрыКлючаСессии);
		КонецЕсли;
		
		СохраняемыеДанные = Новый ХранилищеЗначения(ДанныеКлючаСессии);
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИмяПараметраКлючаСессии.Установить(ПараметрыЗапроса.ИмяПараметраКлючаСессии, Истина);
		
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.ИмяПараметраКлючаСессии = ПараметрыЗапроса.ИмяПараметраКлючаСессии;
		ЗаписьНабора.Данные = СохраняемыеДанные;
		
		НаборЗаписей.Записать(Истина);
		
		ПараметрыСеанса[ПараметрыЗапроса.ИмяПараметраКлючаСессии] = СохраняемыеДанные;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

Функция ПолучитьСохраненныеДанныеКлючаСессии(ИмяПараметраКлючаСессии) Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДанныеКлючаСессии.Данные КАК Данные
	|ИЗ
	|	РегистрСведений.ДанныеКлючаСессииМДЛП КАК ДанныеКлючаСессии
	|ГДЕ
	|	ДанныеКлючаСессии.ИмяПараметраКлючаСессии = &ИмяПараметраКлючаСессии
	|");
	
	Запрос.УстановитьПараметр("ИмяПараметраКлючаСессии", ИмяПараметраКлючаСессии);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Данные.Получить();
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#КонецЕсли
